snlkuharlocal/src/InformationRegisters/УведомленияОПоступившихПлатежах/УведомленияОПоступившихПлатежах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УведомленияОПоступившихПлатежах</name>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПоступлениеНаРасчетныйСчет/ПоступлениеНаРасчетныйСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаРасчетныйСчет</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/УведомленияОПоступившихПлатежах/ManagerModule.bsl
Функция ЗаписатьУведомления(МассивДокументов, Получатель)
КонецФункции //ЗаписатьУведомления(МассивДокументов, Получатель)

Функция УдалитьУведомление(ДокСсылка) Экспорт
	Запись = РегистрыСведений.УведомленияОПоступившихПлатежах.СоздатьМенеджерЗаписи();
	Запись.ДокОснование = ДокСсылка;
	Запись.Удалить();
КонецФункции //УдалитьУведомление(ДокСсылка) Экспорт

Функция СформироватьУведомления()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка 								КАК ППВходящее,
	|	НАЧАЛОПЕРИОДА(Ссылка.Дата, ДЕНЬ) 	КАК ПериодДень,
	//|	МАКСИМУМ(Ссылка.Дата, ДЕНЬ) 		КАК ПериодПо,
	|
	|	Контрагент,
	|	Договор,
	|	Контрагент.Менеджер КАК Менеджер,	
	|	Контрагент.Менеджер.ЕМэйл КАК ЕМэйл
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПРС
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.УведомленияОПоступившихПлатежах КАК Реестр
	|ПО 
	|	ПРС.Ссылка = Реестр.ДокОснование
	|ГДЕ
	|	ПРС.Дата >= &ДатаС
	|	И ПРС.Договор.ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|	И Реестр.ДокОснование ЕСТЬ NULL		
	|УПОРЯДОЧИТЬ ПО
	|	Менеджер,
	|	Контрагент,
	|	ПериодДень,
	|
	|ИТОГИ ПО     
	|	Менеджер,
	|	Контрагент,
	|	ПериодДень	
	|";           
	
	ДатаС = ОпределитьДатуНачалаРассылки();
	Запрос.УстановитьПараметр("ДатаС", ОпределитьДатуНачалаРассылки());
	
	Выборка_Менеджер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Менеджер");
	Пока Выборка_Менеджер.Следующий() Цикл  
		СоздатьПисьмо(Выборка_Менеджер, ДатаС);     					
	КонецЦикла;	
КонецФункции //СформироватьУведомления()

Функция СоздатьПисьмо(Выборка_Менеджер, ДатаС)     
	Если НЕ ЗначениеЗаполнено(Выборка_Менеджер.Менеджер) Тогда
		ТекстСообщения = СтрШаблон("Не указан менеджер у % контрагентов.", Выборка_Менеджер.Количество());
		ЗаписатьВЛог(ИмяЛога(), ТекстСообщения, "Ошибка");	
		Возврат Неопределено;
	КонецЕсли;  
	
	ЕМэйл = Выборка_Менеджер.ЕМэйл;	
	
	ТД = СоздатьРеестрОплат(Выборка_Менеджер, ДатаС);	
КонецФункции //СоздатьПисьмо(Выборка_Менеджер)

Функция СоздатьРеестрОплат(Выборка_Менеджер, ДатаС) Экспорт
	Макет		= ПолучитьМакет("РеестрОплат");
	ДатаПо 		= ТекущаяДата();
	
	пЗаголовка	= Новый Структура("Дата1,Дата2", Формат(ДатаС, "ДФ=dd.MM.yyyy"), Формат(ДатаПо, "ДФ=dd.MM.yyyy"));
	
	ТД = Новый ТабличныйДокумент;
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.Параметры.Заполнить(пЗаголовка);
	
	ТД.Вывести(ОблЗаголовок);
	
	ТД.НачатьАвтогруппировкуСтрок();
	
	Выборка_Контрагент = Выборка_Менеджер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Пока Выборка_Контрагент.Следующий() Цикл	
		Обл = Макет.ПолучитьОбласть("Контрагент");
		Обл.Параметры.Заполнить(Выборка_Контрагент);
		
		ТД.Вывести(Обл, Выборка_Контрагент.Уровень());
		
		Выборка_Дата = Выборка_Контрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПериодДень");
		Пока Выборка_Дата.Следующий() Цикл
			Обл = Макет.ПолучитьОбласть("ПериодДень");
			Обл.Параметры.Заполнить(Выборка_Дата);
		
			ТД.Вывести(Обл, Выборка_Дата.Уровень());
			
			Выборка = Выборка_Дата.Выбрать();
			Пока Выборка.Следующий() Цикл
				Обл = Макет.ПолучитьОбласть("Документ");
				Обл.Параметры.Заполнить(Выборка_Дата);
		
				ТД.Вывести(Обл, Выборка_Дата.Уровень());
			КонецЦикла;			
		КонецЦикла;
	КонецЦикла;	
	
	ТД.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат ТД;
КонецФункции //СоздатьРеестрОплат(Выборка_Менеджер, ДатаС)

Функция ОпределитьДатуНачалаРассылки()
	Возврат Константы.ДатаЗапретаРедактированияДДСпоАвансовымДоговорам.Получить();
КонецФункции // ()

Функция ИмяЛога()
	Возврат "Уведомления о пост. плат";
КонецФункции // ()
